Repository: Mahdi-Suleiman/SEDCO-MVC-Task
Catalog: SurveyQuestionsConfigurator.Entities/Resources/LanguageStrings.*.resx
Languages: ar

source: Arabic
ar: اللغة العربية

source: Back To List
ar: عودة الى القائمة

source: Check Connectivity
ar: تحقق من الاتصال

source: Connection
ar: اعدادات الاتصال

# ConnectionFailedError
source: Connection Failed.
ar: فشل الاتصال.

source: Create
ar: إنشاء سؤال

source: Database Name
ar: اسم قاعدة البيانات

# DatabaseNameRequired
source: Database name is required.
ar: يجب ادخال اسم قاعدة البيانات.

source: Delete
ar: حذف

source: Details
ar: التفاصيل

source: Edit
ar: تعديل

source: End Value
ar: القيمة النهائية لشريط التمرير

source: End Value Caption
ar: عنوان القيمة النهائية لشريط التمرير

# EndValueCaptionRequired
source: End value caption is required.
ar: يجب ادخال القيمة النهائية لشريط التمرير.

# EndValueError
source: End value must be larger than start value.
ar: القيمة النهائية يجب ان تكون اكبر من القيمة الابتدائية

# EndValueRequired
source: End value is required.
ar: يجب الدخال القيمة النهائية.

source: English
ar: اللغة الانجليزية

source: Number Of Smiley Faces
ar: عدد الأوجه المبتسمة

# NumberOfSmileyFacesRequired
source: Number of smiley faces field is required.
ar: يجب ادخال عدد الأوجه المبتسمة.

source: Number Of Stars
ar: عدد النجوم

# NumberOfStarsRequired
source: Number of stars field is required.
ar: يجب ادخال عدد النجوم.

source: Order
ar: الترتيب

# OrderRequired
source: Order is required
ar: يجب ادخال الترتيب.

source: Password
ar: كلمة المرور

# PasswordRequired
source: Password is required
ar: يجب ادخال كلمة المرور.

# QuestionDoesNotExistError
source: This Question doesn't exist, please refresh and try again.
ar: هذا السؤال غير موجود ، يرجى التحديث والمحاولة مرة أخرى.

source: Questions
ar: الاسئلة

source: Save
ar: حفظ

# SavingFailedError
source: Saving failed, please try again.
ar: حدث خطأ أثناء حفظ الإعدادات الرجاء المحاولة مرة اخرى

source: Server Name
ar: اسم الخادم

# ServerNameRequired
source: Server name is required
ar: يجب ادخال اسم الخادم.

# SettingsSavedMessage
source: Settings Saved Successfully.
ar: تم حفظ الإعدادات بنجاح.

source: SLIDER
ar: شريط

source: SMILEY
ar: وجه مبتسم

# SomethingWentWrongError
source: Something went wrong, please try again.
ar: حدث خطأ ما، الرجاء المحاولة مرة أخرى.

source: STAR
ar: نجمة

source: Start Value
ar: القيمة الابتدائية

source: Start Value Caption
ar: عنوان القيمة الابتدائية

# StartValueCaptionRequired
source: Start value caption is required.
ar: يجب ادخال عنوان القيمة الابتدائية.

# StartValueRequired
source: Start value is required.
ar: يجب ادخال القيمة الابتدائية.

# SuccessfulConnectionMessage
source: Connection was successful.
ar: نجح الاتصال.

source: Text
ar: النص

# TextRequired
source: Text is required.
ar: يجب ادخال النص.

source: Type
ar: النوع

source: User Id
ar: اسم المستخدم

# UserIdRequired
source: User Id is required.
ar: يجب ادخال اسم المستخدم.
